In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['harry','rohan','skillf','shubham'],
    "marks":[92,34,24,67],
    "city":['rampur','kolkata','bareilly','antarctica']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

      name  marks        city
0    harry     92      rampur
1    rohan     34     kolkata
2   skillf     24    bareilly
3  shubham     67  antarctica

In [5]:
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends_index_false.csv', index=False)

In [7]:
df.head(2)

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata

In [8]:
df.tail(2)

      name  marks        city
2   skillf     24    bareilly
3  shubham     67  antarctica

In [9]:
df.describe()

           marks
count   4.000000
mean   54.250000
std    31.159536
min    24.000000
25%    31.500000
50%    50.500000
75%    73.250000
max    92.000000

In [10]:
train = {
    "Train No.":[17738,21883,17548,23173],
    "Speed":[92,108,24,67],
    "City":['rampur','kolkata','bareilly','antarctica']
}

In [11]:
df_harry = pd.DataFrame(train)

In [12]:
df_harry.to_csv('trains.csv', index=False)

In [13]:
harry = pd.read_csv('trains.csv')

In [14]:
harry

   Train No.  Speed        City
0      17738     92      rampur
1      21883    108     kolkata
2      17548     24    bareilly
3      23173     67  antarctica

In [15]:
harry['Speed']

0     92
1    108
2     24
3     67
Name: Speed, dtype: int64

In [16]:
harry['Speed'][2]=50

<ipython-input-16-59ede46b72e7>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  harry['Speed'][2]=50

In [17]:
harry

   Train No.  Speed        City
0      17738     92      rampur
1      21883    108     kolkata
2      17548     50    bareilly
3      23173     67  antarctica

In [18]:
harry.to_csv('trains.csv')

In [19]:
harry.index = ['first','second','third','fourth']

In [20]:
harry

        Train No.  Speed        City
first       17738     92      rampur
second      21883    108     kolkata
third       17548     50    bareilly
fourth      23173     67  antarctica

In [21]:
ser = pd.Series(np.random.rand(34))

In [22]:
ser

0     0.049359
1     0.222140
2     0.955558
3     0.372592
4     0.320260
5     0.471351
6     0.422700
7     0.704906
8     0.513120
9     0.295142
10    0.363814
11    0.027194
12    0.977532
13    0.081664
14    0.236561
15    0.441939
16    0.385040
17    0.947191
18    0.199615
19    0.142350
20    0.751888
21    0.728920
22    0.205362
23    0.388148
24    0.009073
25    0.706646
26    0.532209
27    0.014419
28    0.540054
29    0.735789
30    0.831373
31    0.256524
32    0.238964
33    0.125355
dtype: float64

In [23]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [24]:
newdf

            0         1         2         3         4
0    0.664972  0.908830  0.746218  0.205148  0.200853
1    0.646825  0.579459  0.881187  0.466320  0.381243
2    0.993404  0.854345  0.902285  0.554701  0.485933
3    0.007606  0.030815  0.272253  0.160230  0.350329
4    0.903562  0.016515  0.328392  0.677401  0.914179
..        ...       ...       ...       ...       ...
329  0.368993  0.675073  0.452296  0.972189  0.490406
330  0.511519  0.448478  0.046240  0.397592  0.079165
331  0.070211  0.962699  0.942709  0.668054  0.772789
332  0.678664  0.826255  0.704521  0.323470  0.324860
333  0.933266  0.452496  0.502857  0.524621  0.356124

[334 rows x 5 columns]

In [25]:
newdf.head()

          0         1         2         3         4
0  0.664972  0.908830  0.746218  0.205148  0.200853
1  0.646825  0.579459  0.881187  0.466320  0.381243
2  0.993404  0.854345  0.902285  0.554701  0.485933
3  0.007606  0.030815  0.272253  0.160230  0.350329
4  0.903562  0.016515  0.328392  0.677401  0.914179

In [26]:
type(newdf)

pandas.core.frame.DataFrame

In [27]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.493407    0.500400    0.497873    0.482730    0.504837
std      0.291871    0.286134    0.292740    0.293520    0.293039
min      0.000068    0.011528    0.000855    0.004030    0.007657
25%      0.248970    0.248606    0.243557    0.228027    0.251731
50%      0.477184    0.499794    0.480039    0.451818    0.512206
75%      0.746802    0.729245    0.747950    0.734763    0.739024
max      0.998646    0.990919    0.999489    0.996704    0.997538

In [28]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [29]:
newdf[0][0] = 'harry'

In [30]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [32]:
newdf.head()

            0         1         2         3         4
0       harry  0.908830  0.746218  0.205148  0.200853
1    0.646825  0.579459  0.881187  0.466320  0.381243
2    0.993404  0.854345  0.902285  0.554701  0.485933
3  0.00760576  0.030815  0.272253  0.160230  0.350329
4    0.903562  0.016515  0.328392  0.677401  0.914179

In [33]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [35]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)